# Module 05 - Spark SQL - Exercises

## Instructions

This notebook contains exercises based on the concepts learned in Module 05.

- Complete each exercise in the provided code cells
- Run the data setup cells first to generate/create necessary data
- Test your solutions by running the verification cells (if provided)
- Refer back to the main module notebook if you need help

## Data Setup

Run the cells below to set up the data needed for the exercises.

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, StringType, IntegerType, DoubleType, DateType
from pyspark.sql.functions import col, when, lit
import os

os.environ["JAVA_TOOL_OPTIONS"] = (
    "--add-opens=java.base/java.lang=ALL-UNNAMED "
    "--add-opens=java.base/java.nio=ALL-UNNAMED "
    "--add-opens=java.base/sun.nio.ch=ALL-UNNAMED"
)
os.environ["PYSPARK_PYTHON"] = "python"
os.environ["PYSPARK_DRIVER_PYTHON"] = "python"

# Create SparkSession
spark = SparkSession.builder \
    .appName("Module 05 Exercises") \
    .master("local[*]") \
    .getOrCreate()

# Set data directory
data_dir = "../data"
os.makedirs(data_dir, exist_ok=True)
print("SparkSession created successfully!")
print(f"Data directory: {os.path.abspath(data_dir)}")

# Create sample data for Spark SQL exercises
data = [
    ("Alice", 25, "Sales", 50000, "NYC"),
    ("Bob", 30, "IT", 60000, "LA"),
    ("Charlie", 35, "Sales", 70000, "Chicago"),
    ("Diana", 28, "IT", 55000, "Houston"),
    ("Eve", 32, "HR", 65000, "Phoenix"),
    ("Frank", 27, "Sales", 52000, "NYC"),
    ("Grace", 29, "IT", 58000, "LA"),
    ("Henry", 31, "HR", 62000, "Chicago"),
    ("Iris", 26, "Sales", 48000, "NYC"),
    ("Jack", 33, "IT", 64000, "San Francisco")
]

schema = StructType([
    StructField("Name", StringType(), True),
    StructField("Age", IntegerType(), True),
    StructField("Department", StringType(), True),
    StructField("Salary", IntegerType(), True),
    StructField("City", StringType(), True)
])

df_employees = spark.createDataFrame(data, schema)

# Create departments DataFrame
departments_data = [
    ("Sales", "New York", 100000),
    ("IT", "San Francisco", 150000),
    ("HR", "Chicago", 80000),
    ("Finance", "Boston", 90000)
]

departments_schema = StructType([
    StructField("Department", StringType(), True),
    StructField("Location", StringType(), True),
    StructField("Budget", IntegerType(), True)
])

df_departments = spark.createDataFrame(departments_data, departments_schema)

print("Employee DataFrame created:")
df_employees.show()

print("\nDepartments DataFrame created:")
df_departments.show()

SparkSession created successfully!
Data directory: /data
Employee DataFrame created:
+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|  Alice| 25|     Sales| 50000|          NYC|
|    Bob| 30|        IT| 60000|           LA|
|Charlie| 35|     Sales| 70000|      Chicago|
|  Diana| 28|        IT| 55000|      Houston|
|    Eve| 32|        HR| 65000|      Phoenix|
|  Frank| 27|     Sales| 52000|          NYC|
|  Grace| 29|        IT| 58000|           LA|
|  Henry| 31|        HR| 62000|      Chicago|
|   Iris| 26|     Sales| 48000|          NYC|
|   Jack| 33|        IT| 64000|San Francisco|
+-------+---+----------+------+-------------+


Departments DataFrame created:
+----------+-------------+------+
|Department|     Location|Budget|
+----------+-------------+------+
|     Sales|     New York|100000|
|        IT|San Francisco|150000|
|        HR|      Chicago| 80000|
|   Finance|       Boston| 90000|
+----------+-------------+------+

## Exercises

Complete the following exercises based on the concepts from Module 05.

### Exercise 1: Create Temporary View

Create a temporary view named 'employees_view' from df_employees using createOrReplaceTempView.

In [2]:
# Your code here
df_employees.createOrReplaceTempView("employee_view")

### Exercise 2: Basic SQL Query

Write a SQL query to select all employees with salary greater than 55000. Display all columns.

In [3]:
# Your code here
result = spark.sql("""SELECT * FROM employee_view
                   WHERE Salary > 55000
""")
result.show()

+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|    Bob| 30|        IT| 60000|           LA|
|Charlie| 35|     Sales| 70000|      Chicago|
|    Eve| 32|        HR| 65000|      Phoenix|
|  Grace| 29|        IT| 58000|           LA|
|  Henry| 31|        HR| 62000|      Chicago|
|   Jack| 33|        IT| 64000|San Francisco|
+-------+---+----------+------+-------------+

### Exercise 3: Aggregate SQL Query

Write a SQL query to find the average salary by department, ordered by average salary descending.

In [4]:
# Your code here
result = spark.sql("""SELECT Department,AVG(Salary) AS Avarage_Salary FROM employee_view
                   GROUP BY Department
                   ORDER BY AVG(Salary) DESC
""")
result.show()

+----------+--------------+
|Department|Avarage_Salary|
+----------+--------------+
|        HR|       63500.0|
|        IT|       59250.0|
|     Sales|       55000.0|
+----------+--------------+

### Exercise 4: Create Global Temporary View

Create a global temporary view named 'global_employees_view' from df_employees using createOrReplaceGlobalTempView.

In [5]:
# Your code here
df_employees.createOrReplaceGlobalTempView("global_employees_view")

### Exercise 5: SQL Query with Multiple Conditions

Write a SQL query to select employees who are either in the Sales department OR have a salary greater than 60000.

In [6]:
# Your code here
result = spark.sql("""SELECT * from global_temp.global_employees_view
                   WHERE Salary>60000 OR Department=='Sales'
""")
result.show()

+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|  Alice| 25|     Sales| 50000|          NYC|
|Charlie| 35|     Sales| 70000|      Chicago|
|    Eve| 32|        HR| 65000|      Phoenix|
|  Frank| 27|     Sales| 52000|          NYC|
|  Henry| 31|        HR| 62000|      Chicago|
|   Iris| 26|     Sales| 48000|          NYC|
|   Jack| 33|        IT| 64000|San Francisco|
+-------+---+----------+------+-------------+

### Exercise 6: SQL Query with ORDER BY

Write a SQL query to select all employees, ordered by salary in descending order, then by name in ascending order.

In [8]:
# Your code here
result = spark.sql("""Select * from global_temp.global_employees_view
                      Order By salary ASC, Name DESC

""")
result.show()

+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|   Iris| 26|     Sales| 48000|          NYC|
|  Alice| 25|     Sales| 50000|          NYC|
|  Frank| 27|     Sales| 52000|          NYC|
|  Diana| 28|        IT| 55000|      Houston|
|  Grace| 29|        IT| 58000|           LA|
|    Bob| 30|        IT| 60000|           LA|
|  Henry| 31|        HR| 62000|      Chicago|
|   Jack| 33|        IT| 64000|San Francisco|
|    Eve| 32|        HR| 65000|      Phoenix|
|Charlie| 35|     Sales| 70000|      Chicago|
+-------+---+----------+------+-------------+

### Exercise 7: SQL Query with COUNT and GROUP BY

Write a SQL query to count the number of employees in each department.

In [11]:
# Your code here
result = spark.sql("""select Department,count(*) As Employee_count
                      FROM global_temp.global_employees_view
                      GROUP By Department

""")
result.show()

+----------+--------------+
|Department|Employee_count|
+----------+--------------+
|     Sales|             4|
|        HR|             2|
|        IT|             4|
+----------+--------------+

### Exercise 8: SQL Query with HAVING Clause

Write a SQL query to find departments with an average salary greater than 55000. Show department and average salary.

In [12]:
# Your code here
result = spark.sql("""select Department,AVG(SALARY) As Avarage_Salary
                      FROM global_temp.global_employees_view
                      GROUP By Department
                      HAVING AVG(SALARY)>55000

""")
result.show()

+----------+--------------+
|Department|Avarage_Salary|
+----------+--------------+
|        HR|       63500.0|
|        IT|       59250.0|
+----------+--------------+

### Exercise 9: SQL Query with MIN and MAX

Write a SQL query to find the minimum and maximum salary for each department.

In [13]:
# Your code here
result = spark.sql("""select Department,MIN(SALARY) As min_Salary ,MAX(SALARY) As max_Salary
                      FROM global_temp.global_employees_view
                      GROUP By Department

""")
result.show()

+----------+----------+----------+
|Department|min_Salary|max_Salary|
+----------+----------+----------+
|     Sales|     48000|     70000|
|        HR|     62000|     65000|
|        IT|     55000|     64000|
+----------+----------+----------+

### Exercise 10: SQL Query with LIKE

Write a SQL query to select employees whose name starts with 'A'.

In [14]:
# Your code here
result = spark.sql("""select *
                      FROM global_temp.global_employees_view
                      WHERE Name LIKE 'A%'

""")
result.show()

+-----+---+----------+------+----+
| Name|Age|Department|Salary|City|
+-----+---+----------+------+----+
|Alice| 25|     Sales| 50000| NYC|
+-----+---+----------+------+----+

### Exercise 11: SQL Query with IN Clause

Write a SQL query to select employees whose city is either 'NYC' or 'LA'.

In [16]:
# Your code here
result = spark.sql("""select *
                      FROM global_temp.global_employees_view
                      WHERE city IN ('NYC','LA')

""")
result.show()

+-----+---+----------+------+----+
| Name|Age|Department|Salary|City|
+-----+---+----------+------+----+
|Alice| 25|     Sales| 50000| NYC|
|  Bob| 30|        IT| 60000|  LA|
|Frank| 27|     Sales| 52000| NYC|
|Grace| 29|        IT| 58000|  LA|
| Iris| 26|     Sales| 48000| NYC|
+-----+---+----------+------+----+

### Exercise 12: SQL Query with CASE Statement

Write a SQL query to add a new column 'SalaryCategory' that categorizes salaries: 'High' if salary >= 60000, 'Medium' if salary >= 50000, else 'Low'.

In [22]:
# Your code here
result = spark.sql("""select *,
                             CASE
                               WHEN salary >= 60000 THEN 'High'
                               WHEN salary >= 50000 THEN 'Medium'
                               ELSE 'Low'
                             END AS SalaryCategory
                       FROM global_temp.global_employees_view

""")
result.show()

+-------+---+----------+------+-------------+--------------+
|   Name|Age|Department|Salary|         City|SalaryCategory|
+-------+---+----------+------+-------------+--------------+
|  Alice| 25|     Sales| 50000|          NYC|        Medium|
|    Bob| 30|        IT| 60000|           LA|          High|
|Charlie| 35|     Sales| 70000|      Chicago|          High|
|  Diana| 28|        IT| 55000|      Houston|        Medium|
|    Eve| 32|        HR| 65000|      Phoenix|          High|
|  Frank| 27|     Sales| 52000|          NYC|        Medium|
|  Grace| 29|        IT| 58000|           LA|        Medium|
|  Henry| 31|        HR| 62000|      Chicago|          High|
|   Iris| 26|     Sales| 48000|          NYC|           Low|
|   Jack| 33|        IT| 64000|San Francisco|          High|
+-------+---+----------+------+-------------+--------------+

### Exercise 13: SQL Query with Subquery

First, create a view for departments. Then write a SQL query to find employees whose department has a budget greater than 90000.

In [25]:
# Your code here
# First create departments view
df_departments.createOrReplaceTempView("Departments")
# Then write your query
result = spark.sql("""SELECT *
                      FROM Departments
                      WHERE Department IN (
                        SELECT Department
                        FROM Departments
                        Where Budget>90000
                      )

""")
result.show()

+----------+-------------+------+
|Department|     Location|Budget|
+----------+-------------+------+
|        IT|San Francisco|150000|
|     Sales|     New York|100000|
+----------+-------------+------+

### Exercise 14: SQL Query with JOIN

Create views for both employees and departments. Write a SQL query to join employees with departments on the Department column and show employee name, department, and department location.

In [33]:
# Your code here
# Create views first
df_departments.createOrReplaceTempView("department_view")
df_employees.createOrReplaceTempView("employee_view")
# Then write your JOIN query
result = spark.sql("""SELECT e.Name,d.department,d.location
                      FROM employee_view e
                      JOIN department_view d
                      ON e.department == d.department
""")
result.show()

+-------+----------+-------------+
|   Name|department|     location|
+-------+----------+-------------+
|   Iris|     Sales|     New York|
|  Frank|     Sales|     New York|
|Charlie|     Sales|     New York|
|  Alice|     Sales|     New York|
|   Jack|        IT|San Francisco|
|  Grace|        IT|San Francisco|
|  Diana|        IT|San Francisco|
|    Bob|        IT|San Francisco|
|  Henry|        HR|      Chicago|
|    Eve|        HR|      Chicago|
|   NULL|   Finance|       Boston|
+-------+----------+-------------+

### Exercise 15: SQL Query with SUM

Write a SQL query to calculate the total salary for each department.

In [35]:
# Your code here
result = spark.sql("""SELECT Department,SUM(Salary) AS TotalSalary
                      FROM employee_view
                      GROUP BY Department

""")
result.show()

+----------+-----------+
|Department|TotalSalary|
+----------+-----------+
|     Sales|     220000|
|        HR|     127000|
|        IT|     237000|
+----------+-----------+

### Exercise 16: Convert SQL Result to DataFrame

Write a SQL query to select all employees, then convert the result to a DataFrame using spark.table() or by assigning the result directly.

In [37]:
# Your code here
# Write SQL query and convert to DataFrame
df_result = spark.sql("""
    Select * From employee_view
""")
print("Type:", type(df_result))
df_result.show()

print("Using Spark.table() function")
using_table = spark.table("employee_view")
print("Type:", type(using_table))
using_table.show()

Type: <class 'pyspark.sql.classic.dataframe.DataFrame'>
+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|  Alice| 25|     Sales| 50000|          NYC|
|    Bob| 30|        IT| 60000|           LA|
|Charlie| 35|     Sales| 70000|      Chicago|
|  Diana| 28|        IT| 55000|      Houston|
|    Eve| 32|        HR| 65000|      Phoenix|
|  Frank| 27|     Sales| 52000|          NYC|
|  Grace| 29|        IT| 58000|           LA|
|  Henry| 31|        HR| 62000|      Chicago|
|   Iris| 26|     Sales| 48000|          NYC|
|   Jack| 33|        IT| 64000|San Francisco|
+-------+---+----------+------+-------------+

Using Spark.table() function
Type: <class 'pyspark.sql.classic.dataframe.DataFrame'>
+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|  Alice| 25|     Sales| 50000|          NYC|
|    Bob| 30|        IT| 60000|           LA|
|Charlie| 35|     Sales| 70000|      Chicago|
|  Diana| 28|        IT| 55000|      Houston|
|    Eve| 32|        HR| 65000|      Phoenix|
|  Frank| 27|     Sales| 52000|          NYC|
|  Grace| 29|        IT| 58000|           LA|
|  Henry| 31|        HR| 62000|      Chicago|
|   Iris| 26|     Sales| 48000|          NYC|
|   Jack| 33|        IT| 64000|San Francisco|
+-------+---+----------+------+-------------+

### Exercise 17: SQL Query with DISTINCT

Write a SQL query to find all distinct cities where employees work.

In [42]:
# Your code here
result = spark.sql("""SELECT DISTINCT city
                      FROM employee_view
""")
result.show()

+-------------+
|         city|
+-------------+
|      Phoenix|
|           LA|
|      Chicago|
|      Houston|
|          NYC|
|San Francisco|
+-------------+

### Exercise 18: SQL Query with LIMIT

Write a SQL query to select the top 3 employees with the highest salaries.

In [46]:
# Your code here
result = spark.sql("""SELECT * FROM employee_view
                      ORDER BY Salary DESC
                      LIMIT 3

""")
result.show()

+-------+---+----------+------+-------------+
|   Name|Age|Department|Salary|         City|
+-------+---+----------+------+-------------+
|Charlie| 35|     Sales| 70000|      Chicago|
|    Eve| 32|        HR| 65000|      Phoenix|
|   Jack| 33|        IT| 64000|San Francisco|
+-------+---+----------+------+-------------+

### Exercise 19: SQL Query with Aggregate Functions

Write a SQL query to find the count, average, minimum, and maximum salary for each department.

In [49]:
# Your code here
result = spark.sql("""SELECT Department,COUNT(*),AVG(Salary) As AvarageSalary,MIN(Salary) AS MinimumSalary,MAX(Salary) As MaximumSalary
                      From employee_view
                      GROUP BY Department

""")
result.show()

+----------+--------+-------------+-------------+-------------+
|Department|count(1)|AvarageSalary|MinimumSalary|MaximumSalary|
+----------+--------+-------------+-------------+-------------+
|     Sales|       4|      55000.0|        48000|        70000|
|        HR|       2|      63500.0|        62000|        65000|
|        IT|       4|      59250.0|        55000|        64000|
+----------+--------+-------------+-------------+-------------+

### Exercise 20: SQL Query with Window Function (ROW_NUMBER)

Write a SQL query to rank employees within each department by salary using ROW_NUMBER() window function.

In [60]:
# Your code here
result = spark.sql("""SELECT *,
                      ROW_NUMBER() OVER(partition By Department Order By Salary DESC) As Row_Num
                      From employee_view
""")
result.show()

+-------+---+----------+------+-------------+-------+
|   Name|Age|Department|Salary|         City|Row_Num|
+-------+---+----------+------+-------------+-------+
|    Eve| 32|        HR| 65000|      Phoenix|      1|
|  Henry| 31|        HR| 62000|      Chicago|      2|
|   Jack| 33|        IT| 64000|San Francisco|      1|
|    Bob| 30|        IT| 60000|           LA|      2|
|  Grace| 29|        IT| 58000|           LA|      3|
|  Diana| 28|        IT| 55000|      Houston|      4|
|Charlie| 35|     Sales| 70000|      Chicago|      1|
|  Frank| 27|     Sales| 52000|          NYC|      2|
|  Alice| 25|     Sales| 50000|          NYC|      3|
|   Iris| 26|     Sales| 48000|          NYC|      4|
+-------+---+----------+------+-------------+-------+

## Summary

Great job completing the exercises! Review your solutions and compare them with the solutions notebook if needed.